Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །གལ་ཏེ་སེམས་འཁྲུགས་པར་གྱུར་ན་བདག་གིས་ཏིང་ངེ་འཛིན་གང་གིས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་འགྱུར་བ་དེ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་བསྐྱེད་པར་མི་ནུས། བདག་གིས་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་ཡང་མི་འགྱུར། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་ཡང་མི་འགྱུར་རོ།
en: If my mind is agitated, I cannot develop such meditative stabilities as those through which beings are brought to maturation, I will not refine the buddhafields, and indeed I will not attain all-aspect omniscience.

source: །གལ་ཏེ་ཤེས་རབ་འཆལ་པར་གྱུར་ན་བདག་གིས་ཤེས་རབ་དང་ཐབས་མཁས་པས་ཉན་ཐོས་ཀྱིས་དང་། རང་སངས་རྒྱས་ཀྱི་ས་ལས་བཟླས་ཏེ། སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱས་ནས་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་སྦྱངས་ཏེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་བྱ་བར་ཡང་མི་ནུས་སོ་ཞེས་ཏེ།
en: If I am unwise, after transcending the level of the śrāvakas and the level of the pratyekabuddhas through wisdom and skillful means, I will not be able to bring beings to maturation, refine the buddhafields, and then attain all-aspect omniscience.’ “

source: འདི་ལྟར་ཡང་དག་པར་སློབ་སྟེ།
en: They should train in the correct manner, and the following thoughts will arise: {Ki.

source: དེ་ལྟར་བདག་གིས་སེར་སྣའི་དབང་གིས་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་མི་བྱ་བ་ནི་མི་རིགས་མི་ཆའོ།
en: II-III: 52} ‘I will not fulfill the perfection of generosity through miserliness. That would be illogical and contradictory.

source: །ཚུལ་ཁྲིམས་ངན་པའི་དབང་གིས་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། གནོད་སེམས་ཀྱི་དབང་གིས་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ལེ་ལོའི་དབང་གིས་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། འཁྲུག་པའི་དབང་གིས་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་འཆལ་བའི་དབང་གིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་མི་བྱ་བ་ནི་མི་རིགས་མི་ཆ་སྟེ།
en: I will not fulfill the perfection of ethical discipline through immorality, the perfection of tolerance through malice, the perfection of perseverance through indolence, the perfection of meditative concentration through agitation, or the perfection of wisdom through stupidity.

source: ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་རྫོགས་པར་མ་བྱས་པར་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འབྱུང་བར་མི་འགྱུར་རོ་ཞེས་བྱ་བ་དྲན་པ་སྐྱེ་བར་འགྱུར་ཏེ།
en: That would be illogical and contradictory. Without completing the six perfections, I will not be emancipated in all-aspect omniscience!’

source: ཀཽ་ཤི་ཀ་དེ་ལྟར་རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་འཛིན་ཅིང་འཆང་བ་དང་། ཀློག་ཅིང་ཀུན་ཆུབ་པར་བྱེད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་ཅིང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་དང་མི་འབྲལ་བ་དེ་དག་གིས། ཚེ་འདི་དང་ཚེ་རབས་གཞན་ལ་ཡོན་ཏན་འདི་དག་འཐོབ་པར་འགྱུར་རོ།
en: So, Kauśika, those noble sons or noble daughters who take up, uphold, recite, master, and focus their attention correctly on this perfection of wisdom, and who do not separate from the mind set on all-aspect omniscience, will attain these enlightened attributes in this lifetime and in other lives.”

source: །བརྒྱ་བྱིན་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཡོངས་སུ་འདུལ་བ་དང་། ང་རྒྱལ་མ་མཆིས་པར་འགྱུར་བའི་དོན་དུ་ཉེ་བར་གནས་པ་ངོ་མཚར་ཆེའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Śakra, mighty lord of the gods then said, “Blessed Lord, it is wonderful that this perfection of wisdom has been established in that manner for the discipline and humility of bodhisattva great beings!” “

source: ཀཽ་ཤི་ཀ་དེ་ཇི་ལྟར་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཡོངས་སུ་འདུལ་བ་དང་། ང་རྒྱལ་མེད་པའི་དོན་དུ་ཉེ་བར་གནས་པ་ཡིན། བརྒྱ་བྱིན་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཇིག་རྟེན་པའི་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དང་།
en: Kauśika, how has this perfection of wisdom been established in that manner for the discipline and humility of bodhisattva great beings?”

source: རང་སངས་རྒྱས་དང་།
en: asked the Blessed One. “

source: ཉན་ཐོས་རྣམས་ལ་སྦྱིན་པ་ཡོངས་སུ་གཏོང་བ་བགྱིད་ཅིང་འདི་སྙམ་དུ། འདི་ལྟར་བདག་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དང་། རང་སངས་རྒྱས་རྣམས་དང་། ཉན་ཐོས་རྣམས་དང་ཉམ་ཐག་པ་དང་འགྲོན་པོ་དང་། སློང་བ་རྣམས་ལ་སྦྱིན་པ་ཡོངས་སུ་གཏོང་ངོ་སྙམ་དུ་སེམས་ན་དེ་ཐབས་མི་མཁས་པའི་སྦྱིན་པ་དེས་ང་རྒྱལ་དུ་འགྱུར་རོ།
en: Blessed Lord,” replied Śakra, “when bodhisattva great beings practice the mundane perfection of generosity and bestow gifts on the lord buddhas, pratyekabuddhas, and śrāvakas, if they think, ‘I am bestowing gifts on the lord buddhas, pratyekabuddhas, śrāvakas, the destitute, travelers, and beggars,’ they are resorting to pride through their gifts, which are lacking in skillful means.

source: །འཇིག་རྟེན་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། འདི་སྙམ་དུ་འདི་ལྟར་བདག་ནི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །བདག་ནི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ་སྙམ་ན་ཡང་། དེ་དེས་ང་རྒྱལ་དུ་འགྱུར་རོ།
en: When they practice the mundane perfection of ethical discipline, again if they think, ‘I am practicing the perfection of ethical discipline; I am completing the perfection of ethical discipline,’ they are resorting to pride.

source: །འཇིག་རྟེན་པའི་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། འདི་སྙམ་དུ་འདི་ལྟར་བདག་ནི་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །བདག་ནི་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ་སྙམ་ན་ཡང་དེ་དེས་ང་རྒྱལ་དུ་འགྱུར་རོ།
en: When they practice the mundane perfection of tolerance, again if they think, ‘I am practicing the perfection of tolerance; I am completing the perfection of tolerance,’ they are resorting to pride.

source: །འཇིག་རྟེན་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། འདི་སྙམ་དུ་འདི་ལྟར་བདག་ནི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །བདག་ནི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ་སྙམ་ན་ཡང་དེ་དེས་ང་རྒྱལ་དུ་འགྱུར་རོ།
en: When they practice the mundane perfection of perseverance, again if they think, ‘I am practicing the perfection of perseverance; I am completing the perfection of perseverance,’ they are resorting to pride.

source: །འཇིག་རྟེན་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། འདི་སྙམ་དུ་འདི་ལྟར་བདག་ནི་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །བདག་ནི་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །སྙམ་ན་ཡང་དེ་དེས་ང་རྒྱལ་དུ་འགྱུར་རོ། །འཇིག་རྟེན་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ།
en: When they practice the mundane perfection of meditative concentration, again if they think, ‘I am practicing the perfection of meditative concentration; I am completing the perfection of meditative concentration,’ they are resorting to pride. {

source: འདི་སྙམ་དུ་འདི་ལྟར་བདག་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ།
en: Ki.

source: །བདག་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྒོམ་མོ་སྙམ་ན་ཡང་དེ་ཐབས་མི་མཁས་པའི་སླད་དུ་འཇིག་རྟེན་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དེ་དེས་ང་རྒྱལ་དུ་འགྱུར་རོ། །དྲན་པ་ཉེ་བར་གཞག་པ་དང་། ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་།
en: II-III: 53} When they practice the mundane perfection of wisdom, again if they think, ‘I am practicing the perfection of wisdom; I am cultivating the perfection of wisdom,’ that is the mundane perfection of wisdom because it is without skillful means, and they are resorting to pride. “

source: རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཐོབ་པར་བྱའོ་སྙམ་དུ་སེམས་ན་ཡང་།
en: Again, if they think, ‘I will attain the applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, the noble eightfold path, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, the gateways to liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, the eighteen distinct qualities of the buddhas, and [all the fruits and realizations], up to and including all-aspect omniscience, they are resorting to pride because they are attached to acting on the basis of a self. “

source: དེ་བདག་ཏུ་བགྱི་བ་ལ་མངོན་པར་ཆགས་པས་ང་རྒྱལ་དུ་འགྱུར་རོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལྟར་འཇིག་རྟེན་པའི་ཆོས་རྣམས་ལ་སྤྱོད་པའི་ཚེ། བདག་དུ་བགྱི་བ་ལ་མངོན་པར་ཆགས་པས་ང་རྒྱལ་དུ་འགྱུར་ཏེ།
en: Blessed Lord, when bodhisattva great beings practice mundane doctrines in that manner, they are resorting to pride because they are attached to acting on the basis of a self.

source: དེ་ལ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་འདུལ་བ་དང་། ང་རྒྱལ་མ་མཆིས་པའི་སླད་དུ་ཉེ་བར་གནས་སོ།
en: It is in this respect that the perfection of wisdom has been established for the discipline and humility of bodhisattva great beings. “

source: །བཅོམ་ལྡན་འདས་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཇིག་རྟེན་ལས་འདས་པའི་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཤིན་དུ་བསྒོམས་པའི་སླད་དུ་སྦྱིན་པ་ཡང་མི་དམིགས། གཏོང་བ་ཡང་མི་དམིགས་ལེན་པ་ཡང་མི་དམིགས་ཏེ།
en: Blessed Lord, when bodhisattva great beings practice the perfection of supramundane generosity, in order to cultivate the perfection of wisdom to its utmost, they do not even apprehend their gifts, nor do they apprehend the act of giving, nor do they apprehend the recipient.

source: བཅོམ་ལྡན་འདས་དེ་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡོངས་སུ་འདུལ་བ་དང་། ང་རྒྱལ་མ་མཆིས་པའི་སླད་དུ་ཉེ་བར་གནས་སོ།
en: Therefore, Blessed Lord, the perfection of wisdom has been established for the sake of the discipline and humility of bodhisattva great beings who practice the perfection of generosity. “

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ།
en: When they practice the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom, in order to cultivate the perfection of wisdom [and so forth] to their utmost, they do not apprehend even wisdom [and so forth], nor do they apprehend those who possess wisdom [and so forth].

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ཤིན་དུ་བསྒོམས་པའི་སླད་དུ། ཤེས་རབ་དུ་ཡང་མི་དམིགས། ཤེས་རབ་དང་ལྡན་པ་ཡང་མི་དམིགས་ཏེ། བཅོམ་ལྡན་འདས་དེ་ལྟར་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡོངས་སུ་འདུལ་བ་དང་། ང་རྒྱལ་མ་མཆིས་པའི་སླད་དུ་ཉེ་བར་གནས་སོ། །དེ་དྲན་པ་ཉེ་བར་གཞག་པ་དང་། ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། ལམ་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་།
en: Therefore, Blessed Lord, the perfection of wisdom has been established for the sake of the discipline and humility of bodhisattva great beings who practice the perfection of wisdom [and so forth]. “

source: མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་། སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་སྒོམ་ཡང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཤིན་དུ་བསྒོམས་པའི་སླད་དུ་དམིགས་པ་མ་མཆིས་ཏེ།
en: Even though they cultivate the applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, the path, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, the gateways to liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers [of the tathāgatas], the fearlessnesses, the kinds of exact knowledge, the distinct qualities of the buddhas, and [all the fruits and realizations], up to and including all-aspect omniscience, in order to cultivate the perfection of wisdom to its utmost, they do not apprehend them.

source: བཅོམ་ལྡན་འདས་དེ་ལྟར་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡོངས་སུ་འདུལ་བ་དང་། ང་རྒྱལ་མ་མཆིས་པའི་སླད་དུ་ཉེ་བར་གནས་སོ།
en: Therefore, Blessed Lord, the perfection of wisdom has been established for the sake of the discipline and humility of bodhisattva great beings.” {

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་བ་ལས། །ལེའུ་བཅུ་བདུན་པའོ།། །།
en: Ki.II-III: 54} This completes the seventeenth chapter from “The Perfection of Wisdom in Twenty-Five Thousand Lines.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཀཽ་ཤི་ཀ་རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་འཛིན་ཅིང་འཆང་བ་དང་། ཀློག་ཅིང་ཀུན་ཆུབ་པར་བྱེད་པ་དང་ཁ་ཏོན་དུ་བྱེད་ཅིང་ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པ་ཞིག་འཐབ་མོའི་ནང་དུ་འདུག་ཅིང་གཡུལ་ངོར་ཆས་པའི་ཚེ། དེར་གལ་ཏེ་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ། ཟབ་མོ་འདི་ཁ་ཏོན་དུ་བྱས་ནས་སོང་སྟེ་འདུག་ན།
en: Chapter 18 Then the Blessed One said to Śakra, mighty lord of the gods, “Kauśika, when any noble sons or noble daughters who take up, uphold, recite, master, chant, and focus their attention correctly on this profound perfection of wisdom are present in a place of conflict, in the frontline of battle, if those noble sons or noble daughters have gone there and are present there having chanted this profound perfection of wisdom, then those noble sons or noble daughters cannot be defeated.

source: རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེ་ཕམ་པར་མི་ནུས་ཏེ།
en: They will indisputably be victorious.

source: གདོན་མི་ཟ་བར་རྒྱལ་བར་འགྱུར་རོ། །རྒྱལ་ནས་མ་སྨས་མཉམས་པར་འཐབ་མོ་དེ་ལས་ཐར་པར་འགྱུར་ཏེ།
en: Being victorious, they will be delivered from that conflict without anything being said or spoiled. “

source: ཀཽ་ཤི་ཀ་རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ཁ་ཏོན་དུ་བྱེད་ཅིང་གཡུལ་ངོར་སོང་སོང་བ་ལས་སྲོག་གི་བར་ཆད་དུ་འགྱུར་བ་ནི་མི་སྲིད་དེ།
en: Kauśika, when any noble sons or noble daughters have gone into the frontline of battle chanting this profound perfection of wisdom, it is impossible that their lives will be cut off once they are there.

source: གནས་མེད་སྐབས་མེད་དེ།
en: Such an occurrence is impossible!

source: གལ་ཏེ་དེའི་ལུས་ལ། ལ་ལ་ཞིག་གིས་མདས་འཕངས་སམ། མཚོན་གྱིས་བཏབ་ན་ལུས་ལ་ཕོག་ཅིང་འཛུག་པར་མི་འགྱུར་རོ།
en: If some foes were to fire arrows at their bodies or strike them with weapons, their bodies would not be struck or penetrated.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེས་ཡུན་རིང་པོར་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱད་དེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཉིད་ལ་བརྟེན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཉིད་ལ་བསྒོམས་ཏེ།
en: If you ask why, it is because those noble sons or noble daughters will have practiced the six perfections for a long time, and they will have cultivated this very perfection of wisdom relying on this very perfection of wisdom.

source: བདག་གི་འདོད་ཆགས་ཀྱི་མཚོན་དང་། འདོད་ཆགས་ཀྱི་མདའ་ཡང་བཅོམ།
en: They will have subdued the weapons of their own desire and also the arrows of their own desire.

source: གཞན་གྱི་འདོད་ཆགས་ཀྱི་མཚོན་དང་། འདོད་ཆགས་ཀྱི་མདའ་ཡང་བཅོམ།
en: They will have subdued the weapons of others’ desire and also the arrows of others’ desire.

source: བདག་གི་ཞེ་སྡང་གི་མཚོན་དང་། ཞེ་སྡང་གི་མདའ་ཡང་བཅོམ།
en: They will have subdued the weapons of their own hatred and also the arrows of their own hatred.

source: གཞན་གྱི་ཞེ་སྡང་གི་མཚོན་དང་། ཞེ་སྡང་གི་མདའ་ཡང་བཅོམ།
en: They will have subdued the weapons of others’ hatred and also the arrows of others’ hatred.

source: བདག་གི་གཏི་མུག་གི་མཚོན་དང་། གཏི་མུག་གི་མདའ་ཡང་བཅོམ།
en: They will have subdued the weapons of their own delusion and also the arrows of their own delusion.

source: གཞན་གྱི་གཏི་མུག་གི་མཚོན་དང་། གཏི་མུག་གི་མདའ་ཡང་བཅོམ།
en: They will have subdued the weapons of others’ delusion and also the arrows of others’ delusion.

source: བདག་གི་ལྟ་བའི་རྣམ་པའི་མཚོན་དང་། ལྟ་བའི་རྣམ་པའི་མདའ་ཡང་བཅོམ།
en: They will have subdued the weapons of their own wrong views and also the arrows of their own wrong views.

source: གཞན་གྱི་ལྟ་བའི་རྣམ་པའི་མཚོན་དང་། ལྟ་བའི་རྣམ་པའི་མདའ་ཡང་བཅོམ།
en: They will have subdued the weapons of others’ wrong views and also the arrows of others’ wrong views.

source: བདག་གི་ཀུན་ནས་ལྡང་བའི་མཚོན་དང་།
en: They will have subdued the weapons of their own obsessions and also the arrows of their own obsessions.

source: ཀུན་ནས་ལྡང་བའི་མདའ་ཡང་བཅོམ། གཞན་གྱི་ཀུན་ནས་ལྡང་བའི་མཚོན་དང་།
en: They will have subdued the weapons of others’ obsessions and also the arrows of others’ obsessions.

source: ཀུན་ནས་ལྡང་བའི་མདའ་ཡང་བཅོམ། བདག་གི་བག་ལ་ཉལ་བའི་མཚོན་དང་།
en: They will have subdued the weapons of their own latent impulses and also the arrows of their own latent impulses.

source: བག་ལ་ཉལ་བའི་མདའ་ཡང་བཅོམ། གཞན་གྱི་བག་ལ་ཉལ་བའི་མཚོན་དང་།
en: They will have subdued the weapons of others’ latent impulses and also the arrows of others’ latent impulses.

source: བག་ལ་ཉལ་བའི་མདའ་ཡང་བཅོམ་པའི་ཕྱིར་ཏེ། ཀཽ་ཤི་ཀ་རྣམ་གྲངས་དེས་ན། རིགས་ཀྱི་བའམ་རིགས་ཀྱི་བུ་མོ་གཡུལ་དུ་ཕྱིན་པའི་ཚེ། ལུས་ལ་མཚོན་ནམ་མདས་ཕོག་ཅིང་ཟུག་པར་མི་འགྱུར་རོ། །ཀཽ་ཤི་ཀ་གཞན་ཡང་གལ་ཏེ་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་འཛིན་ཅིང་འཆང་བ་དང་། ཀློག་ཅིང་ཀུན་ཆུབ་པར་བྱེད་པ་དང་ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་ཅིང་།
en: Kauśika, this formulation explains how, when noble sons or noble daughters go into battle, their bodies will not be struck or harmed by weapons or arrows. “

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་དང་ཡང་མི་འབྲལ་ན། དེ་ལ་ལ་ལ་ཞིག་གིས་དུག་གིས་གཏོར་ཏམ། བྱད་བྱས་སམ། མེའི་འོབས་སུ་བརྔོད་དམ། མཚོན་གྱིས་བཏབ་བམ། དུག་བླུད་དམ། ཆུར་བོར་ཡང་རུང་སྟེ། དེ་དག་ཐམས་ཅད་ཀྱིས་དེ་ལ་གནོད་པར་མི་འགྱུར་རོ།
en: Moreover, Kauśika, if noble sons or noble daughters take up, uphold, recite, master, and focus their attention correctly on this profound perfection of wisdom, and if they are not separated from the mind set on all-aspect omniscience, whether any foes were to sprinkle them with poison, curse them, roast them in a firepit, strike them with weapons, pour poison into them, or throw them into water, all those perils would not harm them.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཀཽ་ཤི་ཀ་འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་རིག་སྔགས་ཆེན་མོའོ།
en: If you ask why, Kauśika, it is because this perfection of wisdom is the great knowledge.

source: །ཀཽ་ཤི་ཀ་འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་རིག་སྔགས་བླ་ན་མེད་པའོ།
en: Kauśika, it is because this perfection of wisdom is the unsurpassed knowledge incantation. {Ki.

source: །ཀཽ་ཤི་ཀ་འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་རིག་སྔགས་གོང་ན་མེད་པ་སྟེ།
en: II-III: 55} Kauśika, it is because there is no knowledge higher than this perfection of wisdom.

source: རིག་སྔགས་འདི་ལ་སློབ་པའི་རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་ནི་བདག་ལ་ཡང་གནོད་པར་མི་བྱེད། གཞན་ལ་ཡང་གནོད་པར་མི་བྱེད། གཉིས་ཀ་ལ་ཡང་གནོད་པར་མི་བྱེད་དོ།
en: Noble sons or noble daughters who train in this knowledge do not harm themselves, nor do they harm others, nor do they harm both [themselves and others].

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་དེ་འདི་ལ་སློབ་པའི་ཚེ་བདག་མི་དམིགས་སོ་མཐོང་བ་པོའི་བར་དུ་མི་དམིགས་སོ།
en: If you ask why, it is because when they train in it, they do not apprehend a self, and they do not apprehend [any other postulated subject], up to and including viewers.

source: །གཟུགས་མི་དམིགས་སོ།
en: They do not apprehend physical forms.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་། འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་མི་དམིགས་སོ། །སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་དང་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་།
en: They do not apprehend feelings, perceptions, formative predispositions, or consciousness.

source: རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་དང་སོ་སོ་ཡང་དག་པར་རིག་པ་དང་།
en: They do not apprehend the sense fields, the sensory elements, the links of dependent origination, the perfections, all the aspects of emptiness, the factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, the gateways of liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers [of the tathāgatas], the fearlessnesses, the kinds of exact knowledge, the distinct qualities of the buddhas, or [all the fruits and realizations], up to and including all-aspect omniscience.

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་མི་དམིགས་སོ། །དེ་ལྟར་མི་དམིགས་པས་ན་བདག་ལ་ཡང་གནོད་པར་མི་བྱེད། གཞན་ལ་ཡང་གནོད་པར་མི་བྱེད་གཉིས་ཀ་ལ་ཡང་གནོད་པར་མི་བྱེད་དེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཐོབ་ཅིང་།
en: Since they do not apprehend such phenomena, they do not harm themselves, nor do they harm others, nor do they harm both [themselves and others].

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ལ་རྣམ་པར་ལྟ་བར་འགྱུར་རོ།
en: They attain unsurpassed, complete enlightenment, and observe the minds of all beings.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདས་པ་དང་མ་བྱོན་པ་དང་། ད་ལྟར་བྱུང་བའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱིས་ཀྱང་རིག་སྔགས་འདི་ཉིད་ལ་བསླབས་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: If you ask why, the tathāgatas, arhats, completely awakened buddhas of the past, future, and present have also trained [and will train] in this same knowledge incantation, and they have attained [and will attain] consummate buddhahood in unsurpassed, complete enlightenment. “

source: །ཀཽ་ཤི་ཀ་གཞན་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་གཟུང་བ་མ་བྱས་ཁ་ཏོན་མ་བྱས། ཀླག་པ་དང་ཀུན་ཆུབ་པར་མ་བྱས་ཚུལ་བཞིན་དུ་ཡིད་ལ་མ་བྱས་ཀྱང་། གང་ན་བྲི་ཤིང་འཆང་བའི་ཁྱིམ་འམ་གྲོང་ངམ་གྲོང་རྡལ་ལམ་གྲོང་ཁྱེར་དེར་ནི་མིའམ་མི་མ་ཡིན་པ་གླགས་ལྟ་བས་གླགས་རྙེད་པར་མི་འགྱུར་རོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་མཆོད་པའི་ཕྱིར། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷའི་བུ་དང་། སུམ་ཅུ་རྩ་གསུམ་དང་། མཚེ་མ་དང་། དགའ་ལྡན་དང་། འཕྲུལ་དགའ་དང་། གཞན་འཕྲུལ་དབང་བྱེད་དང་། ཚངས་རིས་དང་།
en: Moreover, Kauśika, even though this perfection of wisdom has not been taken up, upheld, recited, mastered, and had attention correctly focused on it, no human or nonhuman being seeking to intrude will be able to intrude within the place where it is committed to writing, or the house, village, town, or city where it is kept.
